# EXAMEN

In [1]:
# 1. Importació i càrrega de dades (1 punt)

# Importa pandas com a pd i carrega els tres fitxers CSV (clients.csv, products.csv, orders.csv).
# Mostra les 5 primeres files de cadascun dels tres dataframes.

In [2]:
import pandas as pd
import numpy as np

# Carregar els fitxers CSV
clients_df = pd.read_csv("data/clients.csv")
products_df = pd.read_csv("data/products.csv")
orders_df = pd.read_csv("data/orders.csv")

# Mostrar les primeres 5 files
print("Clients:")
display(clients_df.head())

print("Productes:")
display(products_df.head())

print("Comandes:")
display(orders_df.head())

Clients:

   client_id      name  age       city gender
0          1  Client_1   56      Palma      F
1          2  Client_2   69  Barcelona      F
2          3  Client_3   46  Barcelona      F
3          4  Client_4   32  Barcelona      F
4          5  Client_5   60  Barcelona      M

Productes:

   product_id product_name     category   price
0           1    Product_1         home   51.52
1           2    Product_2         toys  291.25
2           3    Product_3  electronics   22.79
3           4    Product_4         toys  235.47
4           5    Product_5         home  273.61

Comandes:

   order_id  client_id  product_id  units  order_date
0         1         29          36      2  2022-10-08
1         2         36          70      8  2023-10-29
2         3         89          31      2  2022-04-03
3         4         21          19      5  2023-11-03
4         5         36          61      7  2022-03-02

In [3]:
# 2. Neteja bàsica (1 punt)

# Mostra si existeixen valors nuls o duplicats en cadascun dels dataframes.

# Elimina'ls, si n'hi ha, fent servir les funcions adequades (dropna, drop_duplicates).

# Mostra el nombre de files abans i després del procés.

In [4]:
# Comprovació de valors nuls
print("Valors nuls per dataframe:")
print("Clients:\n", clients_df.isnull().sum())
print("Productes:\n", products_df.isnull().sum())
print("Comandes:\n", orders_df.isnull().sum())

# Comprovació de duplicats
print("\nDuplicats:")
print("Clients:", clients_df.duplicated().sum())
print("Productes:", products_df.duplicated().sum())
print("Comandes:", orders_df.duplicated().sum())

# Eliminació de possibles duplicats o valors nuls
clients_df = clients_df.dropna().drop_duplicates()
products_df = products_df.dropna().drop_duplicates()
orders_df = orders_df.dropna().drop_duplicates()

print("\nMides finals després de la neteja:")
print("Clients:", clients_df.shape)
print("Productes:", products_df.shape)
print("Comandes:", orders_df.shape)

Valors nuls per dataframe:
Clients:
 client_id    0
name         0
age          0
city         0
gender       0
dtype: int64
Productes:
 product_id      0
product_name    0
category        0
price           0
dtype: int64
Comandes:
 order_id      0
client_id     0
product_id    0
units         0
order_date    0
dtype: int64

Duplicats:
Clients: 0
Productes: 0
Comandes: 0

Mides finals després de la neteja:
Clients: (100, 5)
Productes: (100, 4)
Comandes: (100, 5)

In [5]:
# 3. Fusió de datasets (1 punt)

# Uneix els tres datasets per obtenir un únic dataframe sales_df amb tota la informació.
# Empra les claus següents:

# client_id per unir clients_df amb orders_df

# product_id per unir amb products_df

# Mostra les primeres 5 files de sales_df.

In [6]:
# Fusió de clients amb comandes
sales_df = pd.merge(orders_df, clients_df, on="client_id", how="left")

# Fusió amb productes
sales_df = pd.merge(sales_df, products_df, on="product_id", how="left")

display(sales_df.head())

,order_id,client_id,product_id,units,order_date,name,age,city,gender,product_name,category,price
0,1,29,36,2,2022-10-08,Client_29,61,Tarragona,M,Product_36,clothing,82.44
1,2,36,70,8,2023-10-29,Client_36,32,Barcelona,F,Product_70,clothing,331.05
2,3,89,31,2,2022-04-03,Client_89,38,Barcelona,F,Product_31,home,481.51
3,4,21,19,5,2023-11-03,Client_21,61,Girona,M,Product_19,electronics,268.02
4,5,36,61,7,2022-03-02,Client_36,32,Barcelona,F,Product_61,toys,219.76

In [7]:
# 4. Creació de columnes noves (1 punt)

# Afegeix una columna total_price que sigui el resultat de units * price.

# Converteix order_date a tipus datetime.

# Afegeix les columnes year i month extretes d’aquesta data.

In [8]:
# Columna de preu total
sales_df["total_price"] = sales_df["units"] * sales_df["price"]

# Conversió de data
sales_df["order_date"] = pd.to_datetime(sales_df["order_date"])

# Extracció de l’any i el mes
sales_df["year"] = sales_df["order_date"].dt.year
sales_df["month"] = sales_df["order_date"].dt.month

display(sales_df.head())

,order_id,client_id,product_id,units,order_date,name,age,city,gender,product_name,category,price,total_price,year,month
0,1,29,36,2,2022-10-08,Client_29,61,Tarragona,M,Product_36,clothing,82.44,164.88,2022,10
1,2,36,70,8,2023-10-29,Client_36,32,Barcelona,F,Product_70,clothing,331.05,2648.40,2023,10
2,3,89,31,2,2022-04-03,Client_89,38,Barcelona,F,Product_31,home,481.51,963.02,2022,4
3,4,21,19,5,2023-11-03,Client_21,61,Girona,M,Product_19,electronics,268.02,1340.10,2023,11
4,5,36,61,7,2022-03-02,Client_36,32,Barcelona,F,Product_61,toys,219.76,1538.32,2022,3

In [9]:
# 5. Agrupacions i càlculs estadístics (1,5 punts)

# Calcula el total de vendes (total_price) per categoria.

# Calcula la mitjana d’edat dels clients per ciutat.

# Mostra la mitjana de preu i nombre total d’unitats venudes per categoria.

In [10]:
# 1. Total de vendes per categoria
vendes_per_categoria = sales_df.groupby("category")["total_price"].sum()
print("Total de vendes per categoria:")
display(vendes_per_categoria)

# 2. Mitjana d’edat per ciutat
edat_per_ciutat = sales_df.groupby("city")["age"].mean()
print("\nMitjana d’edat per ciutat:")
display(edat_per_ciutat)

# 3. Mitjana de preu i total d’unitats per categoria
resum_categoria = sales_df.groupby("category").agg({
    "price": "mean",
    "units": "sum"
})
print("\nResum per categoria:")
display(resum_categoria)

Total de vendes per categoria:

category
books          10377.66
clothing       21189.68
electronics    21002.85
home           19815.04
toys           31353.21
Name: total_price, dtype: float64

Mitjana d’edat per ciutat:

city
Barcelona    35.552632
Girona       55.000000
Lleida       44.692308
Palma        41.785714
Tarragona    41.958333
Name: age, dtype: float64

Resum per categoria:

                  price  units
category
books        204.650000     48
clothing     249.740526     78
electronics  173.546552    118
home         231.856471     76
toys         237.602000    127

In [11]:
# 6. Filtratge i ordenació (1 punt)

# Mostra les vendes del 2023 per a la categoria electronics.

# Ordena el resultat pel total_price descendent.

In [12]:
# Filtrar vendes de 2023 per electronics
vendes_2023 = sales_df[
    (sales_df["year"] == 2023) & (sales_df["category"] == "electronics")
]

# Ordenar pel total de vendes descendent
vendes_2023 = vendes_2023.sort_values("total_price", ascending=False)

display(vendes_2023)

,order_id,client_id,product_id,units,order_date,name,age,city,gender,product_name,category,price,total_price,year,month
75,76,74,58,7,2023-03-01,Client_74,46,Lleida,F,Product_58,electronics,248.35,1738.45,2023,3
3,4,21,19,5,2023-11-03,Client_21,61,Girona,M,Product_19,electronics,268.02,1340.10,2023,11
33,34,59,58,3,2023-12-20,Client_59,24,Palma,M,Product_58,electronics,248.35,745.05,2023,12
32,33,13,6,5,2023-09-17,Client_13,41,Tarragona,M,Product_6,electronics,146.84,734.20,2023,9
83,84,9,27,4,2023-05-31,Client_9,36,Barcelona,M,Product_27,electronics,139.06,556.24,2023,5
39,40,19,47,4,2023-04-19,Client_19,19,Barcelona,M,Product_47,electronics,127.63,510.52,2023,4
62,63,42,12,6,2023-06-21,Client_42,54,Barcelona,F,Product_12,electronics,67.89,407.34,2023,6
10,11,49,19,1,2023-06-18,Client_49,21,Palma,F,Product_19,electronics,268.02,268.02,2023,6
90,91,38,92,3,2023-06-27,Client_38,68,Girona,M,Product_92,electronics,40.24,120.72,2023,6
57,58,23,3,5,2023-12-15,Client_23,55,Palma,F,Product_3,electronics,22.79,113.95,2023,12

In [13]:
# 7. Anàlisi de benefici (1,5 punts)

# Afegeix una columna cost_unitari, que sigui un valor aleatori entre el 60% i el 90% del preu (price).

# Calcula una nova columna benefici = (price - cost_unitari) * units.

# Agrupa per categoria i mostra:

#  total de vendes

#  benefici total

#  marge mitjà en percentatge → (benefici / total_price) * 100

In [14]:
# Generar un cost unitari aleatori entre el 60% i el 90% del preu
np.random.seed(42)
sales_df["cost_unitari"] = sales_df["price"] * np.random.uniform(0.6, 0.9, len(sales_df))

# Calcular el benefici
sales_df["benefici"] = (sales_df["price"] - sales_df["cost_unitari"]) * sales_df["units"]

# Agrupar per categoria
resum_benefici = sales_df.groupby("category").agg({
    "total_price": "sum",
    "benefici": "sum"
})
resum_benefici["marge_percent"] = (resum_benefici["benefici"] / resum_benefici["total_price"]) * 100

print("Resum de benefici per categoria:")
display(resum_benefici)

Resum de benefici per categoria:

             total_price     benefici  marge_percent
category
books           10377.66  2924.915032      28.184726
clothing        21189.68  4789.190548      22.601524
electronics     21002.85  5831.902211      27.767195
home            19815.04  4293.733302      21.669062
toys            31353.21  8806.573596      28.088268

In [15]:
# 8. Normalització per grups (1 punt)

# Normalitza la columna benefici dins de cada categoria, dividint-la pel màxim benefici d’aquell grup.

# Afegeix el resultat en una nova columna benefici_normalitzat.

In [16]:
# Normalitzar el benefici dins de cada categoria
sales_df["benefici_normalitzat"] = sales_df.groupby("category")["benefici"].transform(lambda x: x / x.max())

display(sales_df[["category", "benefici", "benefici_normalitzat"]].head())

      category    benefici  benefici_normalitzat
0     clothing   47.425748              0.033571
1     clothing  303.998469              0.215193
2         home  173.730558              0.181704
3  electronics  295.361330              0.316736
4         toys  543.326022              0.448795

In [17]:
# 9. Filtratge avançat i exportació (1 punt)

# Mostra només les categories on la mitjana del benefici normalitzat sigui superior a 0.5.

# Desa aquest subconjunt en un fitxer CSV anomenat filtered_sales.csv.

In [18]:
# Calcular la mitjana del benefici normalitzat per categoria
mitjana_benefici = sales_df.groupby("category")["benefici_normalitzat"].mean()

# Filtrar categories amb mitjana > 0.5
categories_filtrades = mitjana_benefici[mitjana_benefici > 0.5].index

# Subconjunt filtrat
filtered_sales = sales_df[sales_df["category"].isin(categories_filtrades)]

display(filtered_sales)

# Exportar a CSV
filtered_sales.to_csv("filtered_sales.csv", index=False)
print("Fitxer 'filtered_sales.csv' desat correctament.")

Empty DataFrame
Columns: [order_id, client_id, product_id, units, order_date, name, age, city, gender, product_name, category, price, total_price, year, month, cost_unitari, benefici, benefici_normalitzat]
Index: []

Fitxer 'filtered_sales.csv' desat correctament.